In [1]:
# initial imports
import pandas as pd
from pathlib import Path

In [2]:
# set the file path
file_path = Path("csv_files/team_salaries2.csv")

# create a Pandas dataframe from a csv file
salaries_df = pd.read_csv(file_path)
salaries_df.head()

   player_id  salary_mm  year              team_name team_id
0  abdursh01       6.60  2009       Sacramento Kings     SAC
1  abrinal01       5.99  2016  Oklahoma City Thunder     OKC
2  abrinal01       5.73  2017  Oklahoma City Thunder     OKC
3    acyqu01       0.67  2012        Toronto Raptors     TOR
4    acyqu01       0.79  2013        Toronto Raptors     TOR

In [3]:
salaries_df.count()

player_id    4490
salary_mm    4490
year         4490
team_name    4490
team_id      4490
dtype: int64

In [18]:
salaries_df_grp = salaries_df.groupby(by=['team_id', 'year'])['salary_mm'].sum().reset_index()
salaries_df_grp.head()

  team_id  year  salary_mm
0     ATL  2009      65.90
1     ATL  2010      71.45
2     ATL  2011      73.65
3     ATL  2012      66.76
4     ATL  2013      55.14